{
    "page": "mms",
    "tags": ["UI", "Branding", "Internship"],
    "title-1": "Travel",
    "title-2": "Rebrand",
    "description": "Full-scale rebrand of a Red Ventures aquired travel brand, Million Mile Secrets.",
    "role": "Lead",
    "timeframe": "8 weeks",
    "takeaways": [
        {
            "title": "Narrow the audience",
            "content": "In an oversaturated market, we had to narrow down the content focus to appeal to a specific audience."
        },
        {
            "title": "Reintroduce ourselves",
            "content": "To focus the content, the brand needed a stronger persona that had a distinct personality and voice."
        },
        {
            "title": "Create unique tools",
            "content": "We needed to find creative ways to draw new consumers into the brand with unique features and content."
        }
    ],
    "sections": [
        {
            "title": "BACKGROUND",
            "text": "Million Mile Secrets, a travel brand, was in need of redesign to narrow down their content and focus their attention on the right users. The goal of the rebrand was to create a more engaging experience on-site with new features and enhancements that was tailored to a target audience. If successful, the brand would be the singular destination for travel exploration and planning."
        },
        {
            "number": "1",
            "title": "CO-CREATIONS",
            "subtitle": "Evolving the brand.",
            "text": "Bringing together the larger team, the creative team hosted co-creations to evaluate where the brand stood and where we wanted it to go. Through tailored exercises, we re-defined key brand identifiers like audience, values, benefits, etc. that would shape the new visual identity."
        },
        {
            "number": "2",
            "title": "BRAND PYRAMID",
            "subtitle": "A new code to live by.",
            "text": "Coming out of the co-creations, we created a new brand pyramid to drive all creative solutions going forward for Million Mile Secrets. It centered around a new brand personality–magician explorer–that is friendly, innovative and unconventional."
        },
        {
            "number": "3",
            "title": "WIREFRAMES",
            "subtitle": "How do we inspire travelers?",
            "text": "For the homepage specifically, the team wireframed out dozens of options targeting inspiration and engagement. We planned to introduce net-new features like destination guides, travel hacks, credit cards partnerships, etc. that aimed to show users how to travel farther on less."
        },
        {
            "number": "4",
            "title": "NEW BRAND GUIDE",
            "subtitle": "Introducing the brand.",
            "text": "Before starting hi-fi designs, we constructed a brand guide to share with internal and external partners. We would use this guide to introduce the new brand and what it stands for. It would also act as a guide for our team as we tackled the visuals for the redesign."
        },
        {
            "number": "5",
            "title": "CLEARED FOR TAKEOFF",
            "subtitle": "The new homepage.",
            "text": "As my final internship project, I created the new landing page for Million Mile Secrets. This page encompasses every aspect of the redesign–from color, to imagery, to structure."
        },
        {
            "title": "CONCLUSION",
            "text": "As an intern, this was an incredible learning opportunity for me to be a part of the entire process creating a brand. The autonomy I received to take on the homepage as my own was instrumental for my growth that summer. The project, unfortunately, was never taken to development as it was absorbed into another brand. Nonetheless, I still learned a lot about collaboration between creative and different functional roles."
        }
    ]
}